name: "tortoise_tts"
backend: "python"

max_batch_size: 0

input [
  {
    name: "TEXT"
    data_type: TYPE_UINT8
    dims: [ -1 ]   # variable-length UTF-8 bytes
  },
  {
    name: "VOICE_NAME"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  },
  {
    name: "PRESET"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]

output [
  {
    name: "AUDIO"
    data_type: TYPE_FP32
    dims: [ -1 ]   # mono waveform
  },
  {
    name: "SAMPLE_RATE"
    data_type: TYPE_INT32
    dims: [ 1 ]
  }
]

instance_group [
  { kind: KIND_GPU, count: 1 }
]

parameters: {
  key: "EXECUTION_ENV_PATH"
  value: { string_value: "requirements.txt" }
}
